#include "lcd.h"


	
/*******************************************************************************
* º¯ Êý Ãû         : Lcd1602_Delay1ms
* º¯Êý¹¦ÄÜ		   : ÑÓÊ±º¯Êý£¬ÑÓÊ±1ms
* Êä    Èë         : c
* Êä    ³ö         : ÎÞ
* Ëµ    Ãû         : ¸Ãº¯ÊýÊÇÔÚ12MHZ¾§ÕñÏÂ£¬12·ÖÆµµ¥Æ¬»úµÄÑÓÊ±¡£
*******************************************************************************/

void Lcd1602_Delay1ms(uint c)   //Îó²î 0us
{
    uchar a,b;
	for (; c>0; c--)
	{
		 for (b=199;b>0;b--)
		 {
		  	for(a=1;a>0;a--);
		 }      
	}
    	
}

/*******************************************************************************
* º¯ Êý Ãû         : LcdWriteCom
* º¯Êý¹¦ÄÜ		   : ÏòLCDÐ´ÈëÒ»¸ö×Ö½ÚµÄÃüÁî
* Êä    Èë         : com
* Êä    ³ö         : ÎÞ
*******************************************************************************/
void LcdWriteCom(uchar com)	  //Ð´ÈëÃüÁî
{
	LCD1602_E = 0;     //Ê¹ÄÜ
	LCD1602_RS = 0;	   //Ñ¡Ôñ·¢ËÍÃüÁî
	LCD1602_RW = 0;	   //Ñ¡ÔñÐ´Èë
	
	LCD1602_DATAPINS = com;     //·ÅÈëÃüÁî
	Lcd1602_Delay1ms(1);		//µÈ´ýÊý¾ÝÎÈ¶¨

	LCD1602_E = 1;	          //Ð´ÈëÊ±Ðò
	Lcd1602_Delay1ms(5);	  //±£³ÖÊ±¼ä
	LCD1602_E = 0;
}
/*******************************************************************************
* º¯ Êý Ãû         : LcdWriteData
* º¯Êý¹¦ÄÜ		   : ÏòLCDÐ´ÈëÒ»¸ö×Ö½ÚµÄÊý¾Ý
* Êä    Èë         : dat
* Êä    ³ö         : ÎÞ
*******************************************************************************/		   
   
void LcdWriteData(uchar dat)			//Ð´ÈëÊý¾Ý
{
	LCD1602_E = 0;	//Ê¹ÄÜÇåÁã
	LCD1602_RS = 1;	//Ñ¡ÔñÊäÈëÊý¾Ý
	LCD1602_RW = 0;	//Ñ¡ÔñÐ´Èë

	LCD1602_DATAPINS = dat; //Ð´ÈëÊý¾Ý
	Lcd1602_Delay1ms(1);

	LCD1602_E = 1;   //Ð´ÈëÊ±Ðò
	Lcd1602_Delay1ms(5);   //±£³ÖÊ±¼ä
	LCD1602_E = 0;
}

/*******************************************************************************
* º¯ Êý Ãû       : LcdInit()
* º¯Êý¹¦ÄÜ		 : ³õÊ¼»¯LCDÆÁ
* Êä    Èë       : ÎÞ
* Êä    ³ö       : ÎÞ
*******************************************************************************/		   
void LcdInit()						  //LCD³õÊ¼»¯×Ó³ÌÐò
{
 	LcdWriteCom(0x38);  //¿ªÏÔÊ¾
	LcdWriteCom(0x0c);  //¿ªÏÔÊ¾²»ÏÔÊ¾¹â±ê
	LcdWriteCom(0x06);  //Ð´Ò»¸öÖ¸Õë¼Ó1
	LcdWriteCom(0x01);  //ÇåÆÁ
	LcdWriteCom(0x80);  //ÉèÖÃÊý¾ÝÖ¸ÕëÆðµã
}
/*******************************************************************************
* º¯ Êý Ãû       : Show_String(uchar addr,uchar *str)
* º¯Êý¹¦ÄÜ		   : ÏÔÊ¾×Ö·û´®
* Êä    Èë       : ×Ö·û´®
* Êä    ³ö       : ÎÞ
*******************************************************************************/
void Show_String(uchar addr,uchar *str)
{
	 LcdWriteCom(addr);
   while(*str != '\0')
	 {
	   LcdWriteData(*str);	
		 str++;
	 }
}
/*******************************************************************************
* å‡½ æ•° å       : Show_Dec_Number(uchar addr,uint temp)
* å‡½æ•°åŠŸèƒ½		   : æ˜¾ç¤ºä¸€ä¸ªåè¿›åˆ¶çš„æ•°æ®
* è¾“    å…¥       : åè¿›åˆ¶æ•°æ®
* è¾“    å‡º       : æ— 
*******************************************************************************/
void Show_Dec_Number(uchar addr,uint temp)
{
   LcdWriteCom(addr);
	 if(temp >= 1000)
	 {
			LcdWriteData(temp/1000+0x30);
			LcdWriteData(temp%1000/100+0x30);
			LcdWriteData(temp%100/10+0x30);
			LcdWriteData(temp%10+0x30);
	 }
	 else if((temp >= 100) && (temp < 1000))
	 {
			LcdWriteData(temp/100+0x30);
			LcdWriteData(temp%100/10+0x30);
			LcdWriteData(temp%10+0x30);
		  LcdWriteData(' ');
	 }
	 else if((temp >= 10) && (temp < 100))
	 {
			LcdWriteData(temp/10+0x30);
			LcdWriteData(temp%10+0x30);
	 }
	 else
	 {
	    LcdWriteData(temp+0x30);
		  LcdWriteData(' ');
	 }
	 
}



