#include "ds1302.h"

/*****************************************************
函数功能：延时若干微秒
入口参数：n
***************************************************/ 
void delaynus(unsigned char n)
{
 unsigned char i;
 for(i=0;i<n;i++)
      ;
}
/*****************************************************
函数功能：向1302写一个字节数据
入口参数：x
***************************************************/ 
void Write1302(unsigned char dat)
{
  unsigned char i; 
  SCLK=0;            //拉低SCLK，为脉冲上升沿写入数据做好准备
  delaynus(2);       //稍微等待，使硬件做好准备
  for(i=0;i<8;i++)      //连续写8个二进制位数据
    {
	    DATA=dat&0x01;    //取出dat的第0位数据写入1302
		delaynus(2);       //稍微等待，使硬件做好准备
		 SCLK=1;           //上升沿写入数据
		 delaynus(2);      //稍微等待，使硬件做好准备
		 SCLK=0;           //重新拉低SCLK，形成脉冲
		 dat>>=1;          //将dat的各数据位右移1位，准备写入下一个数据位
	  }
	
 }
/*****************************************************
函数功能：根据命令字，向1302写一个字节数据
入口参数：Cmd，储存命令字；dat，储存待写的数据
***************************************************/ 
void WriteSet1302(unsigned char Cmd,unsigned char dat)
 {
   RST=0;           //禁止数据传递
   SCLK=0;          //确保写数居前SCLK被拉低
	RST=1;           //启动数据传输
	delaynus(2);     //稍微等待，使硬件做好准备
	Write1302(Cmd);  //写入命令字
	Write1302(dat);  //写数据
	SCLK=1;          //将时钟电平置于已知状态
	RST=0;           //禁止数据传递
 }
/*****************************************************
函数功能：从1302读一个字节数据
入口参数：x
***************************************************/ 
 unsigned char Read1302(void)
 {
   unsigned char i,dat;
	delaynus(2);       //稍微等待，使硬件做好准备
	for(i=0;i<8;i++)   //连续读8个二进制位数据
	 {
	   dat>>=1;       //将dat的各数据位右移1位，因为先读出的是字节的最低位
		if(DATA==1)    //如果读出的数据是1
		 dat|=0x80;    //将1取出，写在dat的最高位
		 SCLK=1;       //将SCLK置于高电平，为下降沿读出
		 delaynus(2);  //稍微等待
		 SCLK=0;       //拉低SCLK，形成脉冲下降沿
		 delaynus(2);  //稍微等待
	  }	 
  return dat;        //将读出的数据返回
}  
/*****************************************************
函数功能：根据命令字，从1302读取一个字节数据
入口参数：Cmd
***************************************************/ 
unsigned char  ReadSet1302(unsigned char Cmd)
 {
  unsigned char dat;
  RST=0;                 //拉低RST
  SCLK=0;                //确保写数居前SCLK被拉低
  RST=1;                 //启动数据传输
  Write1302(Cmd);       //写入命令字
  dat=Read1302();       //读出数据
  SCLK=1;              //将时钟电平置于已知状态
  RST=0;               //禁止数据传递
  return dat;          //将读出的数据返回
}

//函数功能： 1302进行初始化设置

void Init_DS1302(void)
{
    WriteSet1302(0x8E,0x00);                 //根据写状态寄存器命令字，写入不保护指令 
// 	WriteSet1302(0x80,((0/10)<<4|(0%10)));   //根据写秒寄存器命令字，写入秒的初始值
//	WriteSet1302(0x82,((4/10)<<4|(4%10)));   //根据写分寄存器命令字，写入分的初始值
//	WriteSet1302(0x84,((12/10)<<4|(12%10))); //根据写小时寄存器命令字，写入小时的初始值
//	WriteSet1302(0x86,((9/10)<<4|(9%10))); //根据写日寄存器命令字，写入日的初始值
//	WriteSet1302(0x88,((10/10)<<4|(10%10))); //根据写月寄存器命令字，写入月的初始值
//	WriteSet1302(0x8c,((13/10)<<4|(13%10)));   //根据年存器命令字，写入年的初始值
}